read_verilog sail-core-modified/verilog/adder.v sail-core-modified/verilog/cpu.v sail-core-modified/verilog/mux2to1.v sail-core-modified/verilog/alu_control.v sail-core-modified/verilog/pipeline_registers.v sail-core-modified/verilog/alu.v sail-core-modified/verilog/program_counter.v sail-core-modified/verilog/branch_decide.v sail-core-modified/verilog/forwarding_unit.v sail-core-modified/verilog/branch_predictor.v sail-core-modified/verilog/imm_gen.v sail-core-modified/verilog/control_unit.v sail-core-modified/verilog/instruction_mem.v sail-core-modified/verilog/data_mem.v sail-core-modified/verilog/register_file.v sail-core-modified/verilog/CSR.v sail-core-modified/verilog/dataMem_mask_gen.v toplevel.v

synth_ice40 -noflatten -blif sail.blif;

tee -a synthesis_sum.txt stat
write_json sail.json
